mdmfile/src/Catalogs/мдмМэппинги/мдмМэппинги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмМэппинги</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.мдмСхемыДанных</types>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.мдмСхемыДанных</types>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Соответствие</name>
    <attributes>
      <name>ТабличнаяЧастьИсточника</name>
      <type>
        <types>CatalogRef.мдмТабличныеЧасти</types>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитИсточника</name>
      <type>
        <types>CatalogRef.мдмРеквизиты</types>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТабличнаяЧастьПриемника</name>
      <type>
        <types>CatalogRef.мдмТабличныеЧасти</types>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитПриемника</name>
      <type>
        <types>CatalogRef.мдмРеквизиты</types>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмРеквизиты/мдмРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмРеквизиты</name>
  <owners>Catalog.мдмСхемыДанных</owners>
  <owners>Catalog.мдмТабличныеЧасти</owners>
  <owners>Catalog.мдмФормыДанных</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеЗаполнения</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмМэппинги/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Источник) тогда
		Объект.Источник = Неопределено;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Приемник) тогда
		Объект.Приемник = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИсточникПриИзменении(Элементы.Источник);	
	ПриемникПриИзменении(Элементы.Приемник);
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПроверитьРедактированиеМаппинга(Отказ);	
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеПередНачаломИзменения(Элемент, Отказ)
	
	ПроверитьРедактированиеМаппинга(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРедактированиеМаппинга(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Источник) тогда
		мдмОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не заполнен Источник");
		Отказ = Истина;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Приемник) тогда
		мдмОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не заполнен Приемник");
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Объект.Приемник = Неопределено;
	Элемент.КнопкаВыбора = Истина;
	
	Если ТипЗнч(Объект.Приемник) = Тип("Строка") тогда
		
		СтандартнаяОбработка = Ложь;
		
		мдмХранилищеДанныхКлиент.ВыбратьТипОбъектаМастерДанных(Элемент);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Объект.Источник = Неопределено;
	Элемент.КнопкаВыбора = Истина;
	
	Если ТипЗнч(Объект.Источник) = Тип("Строка") тогда
		
		СтандартнаяОбработка = Ложь;
		
		мдмХранилищеДанныхКлиент.ВыбратьТипОбъектаМастерДанных(Элемент);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Источник) тогда
		
		Если ТипЗнч(Объект.Источник) = Тип("Строка") тогда
			
			МетаданныеОбъекта = РеквизитыОбъектаМетаданных(Объект.Источник);
			
			Элементы.СоответствиеРеквизитИсточника.КнопкаВыбора = Истина;
			Элементы.СоответствиеТабличнаяЧастьИсточника.КнопкаВыбора = Истина;
			
			Элементы.СоответствиеРеквизитИсточника.ОграничениеТипа       = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(80));
			Элементы.СоответствиеТабличнаяЧастьИсточника.ОграничениеТипа = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(80));
			
			Элементы.СоответствиеРеквизитПриемника.ОграничениеТипа       = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмРеквизиты"));
			Элементы.СоответствиеТабличнаяЧастьПриемника.ОграничениеТипа = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмТабличныеЧасти"));
			
			УстановитьСвязиПараметровВыбораПриемника();
			
			Объект.Приемник = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмСхемыДанных")).ПривестиЗначение(Объект.Приемник);
			
		ИначеЕсли ТипЗнч(Объект.Источник) = Тип("СправочникСсылка.мдмСхемыДанных") тогда
			
			МетаданныеОбъекта = РеквизитыОбъектаМетаданных(Объект.Приемник);
			
			Элементы.СоответствиеРеквизитИсточника.ОграничениеТипа       = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмРеквизиты"));
			Элементы.СоответствиеТабличнаяЧастьИсточника.ОграничениеТипа = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмТабличныеЧасти"));
			
			Элементы.СоответствиеРеквизитПриемника.КнопкаВыбора = Истина;
			Элементы.СоответствиеТабличнаяЧастьПриемника.КнопкаВыбора = Истина;
			
			Элементы.СоответствиеРеквизитПриемника.ОграничениеТипа       = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(80));
			Элементы.СоответствиеТабличнаяЧастьПриемника.ОграничениеТипа = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(80));
			
			УстановитьСвязиПараметровВыбораИсточника();
			
			Объект.Приемник = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(160)).ПривестиЗначение(Объект.Приемник);
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриемникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Приемник) тогда
		Если ТипЗнч(Объект.Приемник) = Тип("Строка") тогда
			
			МетаданныеОбъекта = РеквизитыОбъектаМетаданных(Объект.Приемник);
			
			Элементы.СоответствиеРеквизитПриемника.КнопкаВыбора = Истина;
			Элементы.СоответствиеТабличнаяЧастьПриемника.КнопкаВыбора = Истина;
			
			Элементы.СоответствиеРеквизитПриемника.ОграничениеТипа       = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(80));
			Элементы.СоответствиеТабличнаяЧастьПриемника.ОграничениеТипа = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(80));
			
			Элементы.СоответствиеРеквизитИсточника.ОграничениеТипа       = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмРеквизиты"));
			Элементы.СоответствиеТабличнаяЧастьИсточника.ОграничениеТипа = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмТабличныеЧасти"));
			
			УстановитьСвязиПараметровВыбораИсточника();
			
			Объект.Источник = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмСхемыДанных")).ПривестиЗначение(Объект.Источник);

		ИначеЕсли ТипЗнч(Объект.Приемник) = Тип("СправочникСсылка.мдмСхемыДанных") тогда
			
			МетаданныеОбъекта = РеквизитыОбъектаМетаданных(Объект.Источник);
			
			Элементы.СоответствиеРеквизитПриемника.ОграничениеТипа       = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмРеквизиты"));
			Элементы.СоответствиеТабличнаяЧастьПриемника.ОграничениеТипа = мдмКонструкторФормыКлиентСервер.ОписаниеТипа(Тип("СправочникСсылка.мдмТабличныеЧасти"));
			
			Элементы.СоответствиеРеквизитИсточника.КнопкаВыбора = Истина;
			Элементы.СоответствиеТабличнаяЧастьИсточника.КнопкаВыбора = Истина;
			
			Элементы.СоответствиеРеквизитИсточника.ОграничениеТипа       = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(80));
			Элементы.СоответствиеТабличнаяЧастьИсточника.ОграничениеТипа = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(80));
			
			УстановитьСвязиПараметровВыбораПриемника();
			
			Объект.Источник = мдмКонструкторФормыКлиентСервер.ОписаниеТипа("Строка", Новый КвалификаторыСтроки(160)).ПривестиЗначение(Объект.Источник);
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СоответствиеТабличнаяЧастьПриемникаПриИзменении(Элементы.СоответствиеТабличнаяЧастьПриемника);
	
	СоответствиеТабличнаяЧастьИсточникаПриИзменении(Элементы.СоответствиеТабличнаяЧастьИсточника);
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеТабличнаяЧастьПриемникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если Объект.Приемник = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеСтроки = Элементы.Соответствие.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Объект.Приемник) = Тип("Строка") тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Для Каждого КлючЗначение из МетаданныеОбъекта.ТабличныеЧасти цикл
			ДанныеВыбора.Добавить(КлючЗначение.Ключ);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеРеквизитИсточникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Источник = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеСтроки = Элементы.Соответствие.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Объект.Источник) = Тип("Строка") тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Если ЗначениеЗаполнено(ДанныеСтроки.ТабличнаяЧастьИсточника) тогда
			ДанныеВыбора.ЗагрузитьЗначения(МетаданныеОбъекта.ТабличныеЧасти[ДанныеСтроки.ТабличнаяЧастьИсточника]);
		Иначе 
			ДанныеВыбора.ЗагрузитьЗначения(МетаданныеОбъекта.Реквизиты);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеТабличнаяЧастьИсточникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Источник = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеСтроки = Элементы.Соответствие.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Объект.Источник) = Тип("Строка") тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Для Каждого КлючЗначение из МетаданныеОбъекта.ТабличныеЧасти цикл
			ДанныеВыбора.Добавить(КлючЗначение.Ключ);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбораПриемника(ВладелецПриемник = Истина)
	
	СвязиПараметровВыбора = Новый Массив;
	СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Приемник"));
	
	Элементы.СоответствиеТабличнаяЧастьПриемника.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	
	Если Не ВладелецПриемник тогда
		СвязиПараметровВыбора = Новый Массив;
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.Соответствие.ТекущиеДанные.ТабличнаяЧастьПриемника"));
	КонецЕсли;

	Элементы.СоответствиеРеквизитПриемника.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	
КонецПроцедуры	

&НаКлиенте
Процедура СоответствиеТабличнаяЧастьПриемникаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДанныеСтроки = Элементы.Соответствие.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Объект.Приемник) = Тип("Строка") тогда
		ДанныеСтроки.РеквизитПриемника = "";
	Иначе 
		ДанныеСтроки.РеквизитПриемника = ПредопределенноеЗначение("Справочник.мдмРеквизиты.ПустаяСсылка");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеТабличнаяЧастьИсточникаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДанныеСтроки = Элементы.Соответствие.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Объект.Источник) = Тип("Строка") тогда
		ДанныеСтроки.РеквизитИсточника = "";
	Иначе 
		ДанныеСтроки.РеквизитПриемника = ПредопределенноеЗначение("Справочник.мдмРеквизиты.ПустаяСсылка");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеТабличнаяЧастьПриемникаПриИзменении(Элемент)
	
	Элементы.СоответствиеРеквизитПриемника.СписокВыбора.Очистить();
	
	Если Объект.Приемник = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеСтроки = Элементы.Соответствие.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Объект.Приемник) <> Тип("Строка") тогда
	
		УстановитьСвязиПараметровВыбораПриемника(Не ЗначениеЗаполнено(ДанныеСтроки.ТабличнаяЧастьПриемника));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеТабличнаяЧастьИсточникаПриИзменении(Элемент)
	
	Элементы.СоответствиеРеквизитИсточника.СписокВыбора.Очистить();
	
	Если Объект.Источник = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеСтроки = Элементы.Соответствие.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Объект.Источник) <> Тип("Строка") тогда
		
		УстановитьСвязиПараметровВыбораИсточника(Не ЗначениеЗаполнено(ДанныеСтроки.ТабличнаяЧастьИсточника));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеРеквизитПриемникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Приемник = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеСтроки = Элементы.Соответствие.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Объект.Приемник) = Тип("Строка") тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Если ЗначениеЗаполнено(ДанныеСтроки.ТабличнаяЧастьПриемника) тогда
			ДанныеВыбора.ЗагрузитьЗначения(МетаданныеОбъекта.ТабличныеЧасти[ДанныеСтроки.ТабличнаяЧастьПриемника]);
		Иначе 
			ДанныеВыбора.ЗагрузитьЗначения(МетаданныеОбъекта.Реквизиты);
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбораИсточника(ВладелецИсточник = Истина)
	
	СвязиПараметровВыбора = Новый Массив;
	СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Источник"));
	
	Элементы.СоответствиеТабличнаяЧастьИсточника.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	
	Если Не ВладелецИсточник тогда
		СвязиПараметровВыбора = Новый Массив;
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.Соответствие.ТекущиеДанные.ТабличнаяЧастьИсточника"));
	КонецЕсли;
	
	Элементы.СоответствиеРеквизитИсточника.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция РеквизитыОбъектаМетаданных(ПолноеИмяМетаданных)
	
	Результат = Новый Структура;
	Результат.Вставить("Реквизиты", Новый Массив);
	Результат.Вставить("ТабличныеЧасти", Новый Структура);
	
	Если Не ЗначениеЗаполнено(ПолноеИмяМетаданных) тогда
		Возврат Результат;
	КонецЕсли;	
	
	ИспользованиеОбщегоРеквизита = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных);
	
	Для Каждого Реквизит из МетаданныеОбъекта.СтандартныеРеквизиты цикл
		Результат.Реквизиты.Добавить(Реквизит.Имя);
	КонецЦикла;	
	
	Для Каждого Реквизит из МетаданныеОбъекта.Реквизиты цикл
		Результат.Реквизиты.Добавить(Реквизит.Имя);
	КонецЦикла;	
	
	Для Каждого Реквизит из Метаданные.ОбщиеРеквизиты цикл
		ЭлементСостава = Реквизит.Состав.Найти(МетаданныеОбъекта);
		Если ЭлементСостава = Неопределено 
			ИЛИ Не ЭлементСостава.Использование = ИспользованиеОбщегоРеквизита.Использовать тогда
			Продолжить;
		КонецЕсли;	
		Результат.Реквизиты.Добавить(Реквизит.Имя);
	КонецЦикла;	
	
	Для Каждого ТабличнаяЧасть из МетаданныеОбъекта.ТабличныеЧасти цикл
		Реквизиты = Новый Массив;
		Результат.ТабличныеЧасти.Вставить(ТабличнаяЧасть.Имя, Реквизиты);
		Для Каждого Реквизит из ТабличнаяЧасть.Реквизиты цикл
			Реквизиты.Добавить(Реквизит.Имя);
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура СменитьНаправление(Команда)
	
	Буфер = Объект.Источник;
	
	Объект.Источник = Объект.Приемник;
	Объект.Приемник = Буфер;
	
	ИсточникПриИзменении(Элементы.Источник);	
	ПриемникПриИзменении(Элементы.Приемник);
	
	Для Каждого ТекущаяСтрока из Объект.Соответствие цикл
		
		БуферРеквизит       = ТекущаяСтрока.РеквизитИсточника;
		БуферТабличнаяЧасть = ТекущаяСтрока.ТабличнаяЧастьИсточника;
		
		ТекущаяСтрока.РеквизитИсточника       = ТекущаяСтрока.РеквизитПриемника;
		ТекущаяСтрока.ТабличнаяЧастьИсточника = ТекущаяСтрока.ТабличнаяЧастьПриемника;
		
		ТекущаяСтрока.РеквизитПриемника       = БуферРеквизит;
		ТекущаяСтрока.ТабличнаяЧастьПриемника = БуферТабличнаяЧасть;
		
	КонецЦикла;	
	
КонецПроцедуры
